#Область ПрограммныйИнтерфейс

	// Если необходимо дописываем нужные поля для добавления или вставки на выбранную Форму
	// ДобавитьПоле Формы
	// ВставитьПоле Формы
Процедура ДополнитьФорму(Форма) Экспорт
		
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма, Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицо(Форма, Форма.Элементы.СуммаДокумента);
	ИначеЕсли Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	    ВставитьПолеКонтактноеЛицо(Форма, Форма.Элементы.СуммаДокумента);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма, Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма, Форма.Элементы.ГруппаШапкаПраво);
	КонецЕсли;
		
КонецПроцедуры

//ГруппаКудаВставить - передается группа на форме куда необходимо вставить
//Элементы - передается тот элемент который необходимо вставить
Процедура СоздатьГруппуСкидка(ГруппаКудаВставить, Элементы) Экспорт
		
	Группа = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),ГруппаКудаВставить);
	Группа.Вид =ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Группа скидки: ";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицо(Форма, ГруппаКудаВставить)
	
	//На выбранной форме выбераем группу куда неодходимо Добавить Объект.ДЗ_КонтактноеЛицо 
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), ГруппаКудаВставить);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицо(Форма, ВставитьПередЭлементом)

	//На выбранной форме выбераем Перед каким элементом неодходимо вставить Объект.ДЗ_КонтактноеЛицо
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, ВставитьПередЭлементом);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";

КонецПроцедуры

#КонецОбласти
